jankaluza/qsimkit/CPU/Variants/msp430x20x3.cpp
#ifndef MC0
#define MC0 0x0010
#endif
#ifndef WDTCTL_
#define WDTCTL_ 0x0120
#endif
#ifndef __msp430_headers_flash_h
#define __msp430_headers_flash_h 
#endif
#ifndef SCG0
#define SCG0 0x0040
#endif
#ifndef SCG1
#define SCG1 0x0080
#endif
#ifndef LFXT1OF
#define LFXT1OF 0x01
#endif
#ifndef TA0CCTL0_
#define TA0CCTL0_ 0x0162
#endif
#ifndef USIDIV_DIV4
#define USIDIV_DIV4 USIDIV_2
#endif
#ifndef MC_UPTO_CCR0
#define MC_UPTO_CCR0 MC_1
#endif
#ifndef TA0CCTL1_
#define TA0CCTL1_ 0x0164
#endif
#ifndef MC_UPDOWN
#define MC_UPDOWN MC_3
#endif
#ifndef __IOMACROS_H_
#define __IOMACROS_H_ 
#endif
#ifndef __msp430_headers_common_h
#define __msp430_headers_common_h 
#endif
#ifndef LFXT1S0
#define LFXT1S0 0x10
#endif
#ifndef LFXT1S1
#define LFXT1S1 0x20
#endif
#ifndef __ASSEMBLER__
#define __ASSEMBLER__ 1
#endif
#ifndef SD16BUF0
#define SD16BUF0 0x2000
#endif
#ifndef SD16XDIV0
#define SD16XDIV0 0x0200
#endif
#ifndef SD16XDIV1
#define SD16XDIV1 0x0400
#endif
#ifndef MOD0
#define MOD0 0x01
#endif
#ifndef XTS
#define XTS 0x40
#endif
#ifndef SD16_VECTOR
#define SD16_VECTOR 10
#endif
#ifndef USIDIV_DIV16
#define USIDIV_DIV16 USIDIV_4
#endif
#ifndef SD16CTL_
#define SD16CTL_ 0x0100
#endif
#ifndef __HAVE_BUILTIN_SETJMP__
#define __HAVE_BUILTIN_SETJMP__ 1
#endif
#ifndef SD16GAIN1
#define SD16GAIN1 0x0010
#endif
#ifndef TACCR0
#define TACCR0 TA0CCR0
#endif
#ifndef TACCR1
#define TACCR1 TA0CCR1
#endif
#ifndef TA0R_
#define TA0R_ 0x0170
#endif
#ifndef USIDIV_DIV32
#define USIDIV_DIV32 USIDIV_5
#endif
#ifndef SD16OVIFG
#define SD16OVIFG 0x0020
#endif
#ifndef P1OUT_
#define P1OUT_ 0x0021
#endif
#ifndef USIDIV_DIV64
#define USIDIV_DIV64 USIDIV_6
#endif
#ifndef __msp430_headers_sd16_h__
#define __msp430_headers_sd16_h__ 
#endif
#ifndef SEGWRT
#define SEGWRT 0x0080
#endif
#ifndef P1SEL_
#define P1SEL_ 0x0026
#endif
#ifndef OUT
#define OUT 0x0004
#endif
#ifndef CM_POS
#define CM_POS CM_1
#endif
#ifndef XT2OF
#define XT2OF 0x02
#endif
#ifndef USICNT_
#define USICNT_ 0x007B
#endif
#ifndef __MSP430_HAS_FLASH2__
#define __MSP430_HAS_FLASH2__ 
#endif
#ifndef FN0
#define FN0 0x0001
#endif
#ifndef FN1
#define FN1 0x0002
#endif
#ifndef FN2
#define FN2 0x0004
#endif
#ifndef FN3
#define FN3 0x0008
#endif
#ifndef FN4
#define FN4 0x0010
#endif
#ifndef FN5
#define FN5 0x0020
#endif
#ifndef SD16OSR0
#define SD16OSR0 0x0100
#endif
#ifndef SD16OSR1
#define SD16OSR1 0x0200
#endif
#ifndef SELS
#define SELS 0x08
#endif
#ifndef CM_BOTH
#define CM_BOTH CM_3
#endif
#ifndef FSSEL_SMCLK
#define FSSEL_SMCLK FSSEL_2
#endif
#ifndef TASSEL_SMCLK
#define TASSEL_SMCLK TASSEL_2
#endif
#ifndef __SIZE_TYPE__
#define __SIZE_TYPE__ unsigned int
#endif
#ifndef USI_VECTOR
#define USI_VECTOR 8
#endif
#ifndef XT2S0
#define XT2S0 0x40
#endif
#ifndef XT2S1
#define XT2S1 0x80
#endif
#ifndef SD16SNGL
#define SD16SNGL 0x0400
#endif
#ifndef SD16INTDLY0
#define SD16INTDLY0 0x0040
#endif
#ifndef SD16INTDLY1
#define SD16INTDLY1 0x0080
#endif
#ifndef __MSP430_HAS_PORT2_R__
#define __MSP430_HAS_PORT2_R__ 
#endif
#ifndef SCS
#define SCS 0x0800
#endif
#ifndef CCTL1
#define CCTL1 TA0CCTL1
#endif
#ifndef CALDCO_12MHZ_
#define CALDCO_12MHZ_ 0x10FA
#endif
#ifndef LPM0
#define LPM0 CPUOFF
#endif
#ifndef LPM1
#define LPM1 SCG0+CPUOFF
#endif
#ifndef LPM2
#define LPM2 SCG1+CPUOFF
#endif
#ifndef LPM3
#define LPM3 SCG1+SCG0+CPUOFF
#endif
#ifndef LPM4
#define LPM4 SCG1+SCG0+OSCOFF+CPUOFF
#endif
#ifndef SD16SSEL_MCLK
#define SD16SSEL_MCLK SD16SSEL_0
#endif
#ifndef __msp430_headers_eprom_h
#define __msp430_headers_eprom_h 
#endif
#ifndef __GNUC_PATCHLEVEL__
#define __GNUC_PATCHLEVEL__ 3
#endif
#ifndef SELM_LFXTCLK
#define SELM_LFXTCLK SELM_3
#endif
#ifndef OUTMOD_RESET
#define OUTMOD_RESET OUTMOD_5
#endif
#ifndef FSSEL0
#define FSSEL0 0x0040
#endif
#ifndef FSSEL1
#define FSSEL1 0x0080
#endif
#ifndef XCAP0
#define XCAP0 0x04
#endif
#ifndef XCAP1
#define XCAP1 0x08
#endif
#ifndef CALDCO_1MHZ_
#define CALDCO_1MHZ_ 0x10FE
#endif
#ifndef SD16SSEL0
#define SD16SSEL0 0x0010
#endif
#ifndef SD16SSEL1
#define SD16SSEL1 0x0020
#endif
#ifndef SD16IFG
#define SD16IFG 0x0004
#endif
#ifndef CALDCO_8MHZ_
#define CALDCO_8MHZ_ 0x10FC
#endif
#ifndef ACCVIFG
#define ACCVIFG 0x0004
#endif
#ifndef __msp430_headers_clock_h
#define __msp430_headers_clock_h 
#endif
#ifndef P2DIR_
#define P2DIR_ 0x002A
#endif
#ifndef CM_NEG
#define CM_NEG CM_2
#endif
#ifndef SD16CCTL0_
#define SD16CCTL0_ 0x0102
#endif
#ifndef FXKEY
#define FXKEY 0x3300
#endif
#ifndef DIVA_DIV1
#define DIVA_DIV1 DIVA_0
#endif
#ifndef DIVA_DIV2
#define DIVA_DIV2 DIVA_1
#endif
#ifndef DIVA_DIV4
#define DIVA_DIV4 DIVA_2
#endif
#ifndef DIVA_DIV8
#define DIVA_DIV8 DIVA_3
#endif
#ifndef EPCTL_
#define EPCTL_ 0x0054
#endif
#ifndef SD16CCTL1_
#define SD16CCTL1_ 0x0104
#endif
#ifndef __MSP430_SD16IV_BASE__
#define __MSP430_SD16IV_BASE__ 0x110
#endif
#ifndef BIT1
#define BIT1 0x0002
#endif
#ifndef BIT2
#define BIT2 0x0004
#endif
#ifndef BIT3
#define BIT3 0x0008
#endif
#ifndef BIT4
#define BIT4 0x0010
#endif
#ifndef BIT5
#define BIT5 0x0020
#endif
#ifndef BIT7
#define BIT7 0x0080
#endif
#ifndef BIT8
#define BIT8 0x0100
#endif
#ifndef BIT9
#define BIT9 0x0200
#endif
#ifndef SD16MEM0_
#define SD16MEM0_ __MSP430_SD16MEM_BASE__ + 0x00
#endif
#ifndef BITA
#define BITA 0x0400
#endif
#ifndef BITB
#define BITB 0x0800
#endif
#ifndef BITC
#define BITC 0x1000
#endif
#ifndef BITD
#define BITD 0x2000
#endif
#ifndef BITE
#define BITE 0x4000
#endif
#ifndef BITF
#define BITF 0x8000
#endif
#ifndef SELM_XT2CLK
#define SELM_XT2CLK SELM_2
#endif
#ifndef WDTCNTCL
#define WDTCNTCL 0x0008
#endif
#ifndef MOD1
#define MOD1 0x02
#endif
#ifndef MOD2
#define MOD2 0x04
#endif
#ifndef MOD3
#define MOD3 0x08
#endif
#ifndef MOD4
#define MOD4 0x10
#endif
#ifndef P2REN_
#define P2REN_ 0x002F
#endif
#ifndef CCTL0_
#define CCTL0_ TA0CCTL0_
#endif
#ifndef IE1_
#define IE1_ 0x0000
#endif
#ifndef SD16GAIN0
#define SD16GAIN0 0x0008
#endif
#ifndef CCTL1_
#define CCTL1_ TA0CCTL1_
#endif
#ifndef NMI_VECTOR
#define NMI_VECTOR 28
#endif
#ifndef USICTL0_
#define USICTL0_ 0x0078
#endif
#ifndef __MSP430_HAS_PORT1_R__
#define __MSP430_HAS_PORT1_R__ 
#endif
#ifndef CALBC1_16MHZ_
#define CALBC1_16MHZ_ 0x10F9
#endif
#ifndef SD16GAIN2
#define SD16GAIN2 0x0020
#endif
#ifndef TASSEL_INCLK
#define TASSEL_INCLK TASSEL_3
#endif
#ifndef __MSP430_HAS_SD16_A__
#define __MSP430_HAS_SD16_A__ 
#endif
#ifndef P2IFG_
#define P2IFG_ 0x002B
#endif
#ifndef TIMERA1_VECTOR
#define TIMERA1_VECTOR 16
#endif
#ifndef TASSEL_ACLK
#define TASSEL_ACLK TASSEL_1
#endif
#ifndef TA0CCR0_
#define TA0CCR0_ 0x0172
#endif
#ifndef TACTL_
#define TACTL_ TA0CTL_
#endif
#ifndef CCR0_
#define CCR0_ TA0CCR0_
#endif
#ifndef WDTNMI
#define WDTNMI 0x0020
#endif
#ifndef SD16DF
#define SD16DF 0x0010
#endif
#ifndef TA0CCR1_
#define TA0CCR1_ 0x0174
#endif
#ifndef CCR1_
#define CCR1_ TA0CCR1_
#endif
#ifndef OUTMOD_OUT
#define OUTMOD_OUT OUTMOD_0
#endif
#ifndef DCO0
#define DCO0 0x20
#endif
#ifndef DCO1
#define DCO1 0x40
#endif
#ifndef DCO2
#define DCO2 0x80
#endif
#ifndef FSSEL_MCLK
#define FSSEL_MCLK FSSEL_1
#endif
#ifndef __MSP430_SD16MEM_BASE__
#define __MSP430_SD16MEM_BASE__ 0x112
#endif
#ifndef WDT_VECTOR
#define WDT_VECTOR 20
#endif
#ifndef SELM0
#define SELM0 0x40
#endif
#ifndef SELM1
#define SELM1 0x80
#endif
#ifndef SD16XOSR
#define SD16XOSR 0x0800
#endif
#ifndef CAP
#define CAP 0x0100
#endif
#ifndef SD16IE
#define SD16IE 0x0008
#endif
#ifndef __USER_LABEL_PREFIX__
#define __USER_LABEL_PREFIX__ 
#endif
#ifndef USISSEL_SCLK
#define USISSEL_SCLK USISSEL_0
#endif
#ifndef CCI
#define CCI 0x0008
#endif
#ifndef XT2OFF
#define XT2OFF 0x80
#endif
#ifndef __MSP430_HAS_TA2__
#define __MSP430_HAS_TA2__ 
#endif
#ifndef __STDC_HOSTED__
#define __STDC_HOSTED__ 1
#endif
#ifndef SD16LP
#define SD16LP 0x0100
#endif
#ifndef OUTMOD_SET
#define OUTMOD_SET OUTMOD_1
#endif
#ifndef SD16LSBTOG
#define SD16LSBTOG 0x0080
#endif
#ifndef OUTMOD_RESET_SET
#define OUTMOD_RESET_SET OUTMOD_7
#endif
#ifndef P1REN_
#define P1REN_ 0x0027
#endif
#ifndef MC_STOP
#define MC_STOP MC_0
#endif
#ifndef TASSEL_TACLK
#define TASSEL_TACLK TASSEL_0
#endif
#ifndef ID_DIV1
#define ID_DIV1 ID_0
#endif
#ifndef ID_DIV2
#define ID_DIV2 ID_1
#endif
#ifndef ID_DIV4
#define ID_DIV4 ID_2
#endif
#ifndef ID_DIV8
#define ID_DIV8 ID_3
#endif
#ifndef TACLR
#define TACLR 0x0004
#endif
#ifndef SD16AE0
#define SD16AE0 0x0001
#endif
#ifndef SD16AE1
#define SD16AE1 0x0002
#endif
#ifndef SD16AE2
#define SD16AE2 0x0004
#endif
#ifndef SD16AE3
#define SD16AE3 0x0008
#endif
#ifndef SD16AE4
#define SD16AE4 0x0010
#endif
#ifndef SD16AE5
#define SD16AE5 0x0020
#endif
#ifndef SD16AE6
#define SD16AE6 0x0040
#endif
#ifndef SD16AE7
#define SD16AE7 0x0080
#endif
#ifndef SD16AE_
#define SD16AE_ 0x00B7
#endif
#ifndef MERAS
#define MERAS 0x0004
#endif
#ifndef __MSP430__
#define __MSP430__ 1
#endif
#ifndef SD16VMIDON
#define SD16VMIDON 0x0008
#endif
#ifndef __WCHAR_TYPE__
#define __WCHAR_TYPE__ int
#endif
#ifndef __MSP430_HAS_BC2__
#define __MSP430_HAS_BC2__ 
#endif
#ifndef EMEX
#define EMEX 0x0020
#endif
#ifndef SD16UNI
#define SD16UNI 0x1000
#endif
#ifndef OUTMOD_TOGGLE_RESET
#define OUTMOD_TOGGLE_RESET OUTMOD_2
#endif
#ifndef CM0
#define CM0 0x4000
#endif
#ifndef CM1
#define CM1 0x8000
#endif
#ifndef WRT
#define WRT 0x0040
#endif
#ifndef P1IFG_
#define P1IFG_ 0x0023
#endif
#ifndef WDTPW
#define WDTPW 0x5A00
#endif
#ifndef COV
#define COV 0x0002
#endif
#ifndef OUTMOD_TOGGLE
#define OUTMOD_TOGGLE OUTMOD_4
#endif
#ifndef TACTL
#define TACTL TA0CTL
#endif
#ifndef EEI
#define EEI 0x0008
#endif
#ifndef __INT_MAX__
#define __INT_MAX__ 32767
#endif
#ifndef SD16SSEL_SMCLK
#define SD16SSEL_SMCLK SD16SSEL_1
#endif
#ifndef FWKEY
#define FWKEY 0xA500
#endif
#ifndef WDTTMSEL
#define WDTTMSEL 0x0010
#endif
#ifndef BCSCTL1_
#define BCSCTL1_ 0x0057
#endif
#ifndef BCSCTL2_
#define BCSCTL2_ 0x0058
#endif
#ifndef KEYV
#define KEYV 0x0002
#endif
#ifndef EPEXE
#define EPEXE 0x01
#endif
#ifndef P2IE_
#define P2IE_ 0x002D
#endif
#ifndef USISSEL_ACLK
#define USISSEL_ACLK USISSEL_1
#endif
#ifndef BCSCTL3_
#define BCSCTL3_ 0x0053
#endif
#ifndef LOCK
#define LOCK 0x0010
#endif
#ifndef P2IN_
#define P2IN_ 0x0028
#endif
#ifndef DIVM_DIV1
#define DIVM_DIV1 DIVM_0
#endif
#ifndef DIVM_DIV2
#define DIVM_DIV2 DIVM_1
#endif
#ifndef DIVM_DIV4
#define DIVM_DIV4 DIVM_2
#endif
#ifndef DIVM_DIV8
#define DIVM_DIV8 DIVM_3
#endif
#ifndef __WINT_TYPE__
#define __WINT_TYPE__ unsigned int
#endif
#ifndef __GNUC__
#define __GNUC__ 3
#endif
#ifndef SELM_DCOCLK
#define SELM_DCOCLK SELM_0
#endif
#ifndef PORT2_VECTOR
#define PORT2_VECTOR 6
#endif
#ifndef __msp430_headers_gpio_h
#define __msp430_headers_gpio_h 
#endif
#ifndef FSSEL_0
#define FSSEL_0 0x0000
#endif
#ifndef FSSEL_1
#define FSSEL_1 0x0040
#endif
#ifndef FSSEL_2
#define FSSEL_2 0x0080
#endif
#ifndef FSSEL_3
#define FSSEL_3 0x00C0
#endif
#ifndef CCIFG
#define CCIFG 0x0001
#endif
#ifndef USISR_
#define USISR_ 0x007C
#endif
#ifndef __msp430_headers_usi_h__
#define __msp430_headers_usi_h__ 
#endif
#ifndef CCIE
#define CCIE 0x0010
#endif
#ifndef LOCKA
#define LOCKA 0x0040
#endif
#ifndef SD16SSEL_ACLK
#define SD16SSEL_ACLK SD16SSEL_2
#endif
#ifndef __msp430x20x3
#define __msp430x20x3 
#endif
#ifndef TACCR0_
#define TACCR0_ TA0CCR0_
#endif
#ifndef TAIE
#define TAIE 0x0002
#endif
#ifndef GIE
#define GIE 0x0008
#endif
#ifndef FAIL
#define FAIL 0x0080
#endif
#ifndef TAIV
#define TAIV TA0IV
#endif
#ifndef __MSP430_HAS_SD16_BUF__
#define __MSP430_HAS_SD16_BUF__ 
#endif
#ifndef OUTMOD_SET_RESET
#define OUTMOD_SET_RESET OUTMOD_3
#endif
#ifndef TACCR1_
#define TACCR1_ TA0CCR1_
#endif
#ifndef P1DIR_
#define P1DIR_ 0x0022
#endif
#ifndef WDTIS0
#define WDTIS0 0x0001
#endif
#ifndef WDTIS1
#define WDTIS1 0x0002
#endif
#ifndef BLKWRT
#define BLKWRT 0x0080
#endif
#ifndef OUTMOD_TOGGLE_SET
#define OUTMOD_TOGGLE_SET OUTMOD_6
#endif
#ifndef CCTL0
#define CCTL0 TA0CCTL0
#endif
#ifndef CCR0
#define CCR0 TA0CCR0
#endif
#ifndef CCR1
#define CCR1 TA0CCR1
#endif
#ifndef MC_CONT
#define MC_CONT MC_2
#endif
#ifndef TAIFG
#define TAIFG 0x0001
#endif
#ifndef MSP430_NO_HW_MUL
#define MSP430_NO_HW_MUL 1
#endif
#ifndef RSEL0
#define RSEL0 0x01
#endif
#ifndef RSEL1
#define RSEL1 0x02
#endif
#ifndef RSEL2
#define RSEL2 0x04
#endif
#ifndef RSEL3
#define RSEL3 0x08
#endif
#ifndef SD16SC
#define SD16SC 0x0002
#endif
#ifndef SD16MEM1_
#define SD16MEM1_ __MSP430_SD16MEM_BASE__ + 0x02
#endif
#ifndef ID0
#define ID0 0x0040
#endif
#ifndef ID1
#define ID1 0x0080
#endif
#ifndef CCIS0
#define CCIS0 0x1000
#endif
#ifndef CCIS1
#define CCIS1 0x2000
#endif
#ifndef TAR
#define TAR TA0R
#endif
#ifndef CALBC1_12MHZ_
#define CALBC1_12MHZ_ 0x10FB
#endif
#ifndef __USING_SJLJ_EXCEPTIONS__
#define __USING_SJLJ_EXCEPTIONS__ 1
#endif
#ifndef USICKCTL_
#define USICKCTL_ 0x007A
#endif
#ifndef __MSP430_HAS_SD16_CH1__
#define __MSP430_HAS_SD16_CH1__ 
#endif
#ifndef TIMERA0_VECTOR
#define TIMERA0_VECTOR 18
#endif
#ifndef SD16OVIE
#define SD16OVIE 0x0002
#endif
#ifndef USICTL_
#define USICTL_ 0x0078
#endif
#ifndef USISSEL_SMCLK
#define USISSEL_SMCLK USISSEL_2
#endif
#ifndef TAR_
#define TAR_ TA0R_
#endif
#ifndef SD16PRE0_
#define SD16PRE0_ 0x00B8
#endif
#ifndef EEIEX
#define EEIEX 0x0010
#endif
#ifndef __MSP430_HAS_USI__
#define __MSP430_HAS_USI__ 
#endif
#ifndef SD16PRE1_
#define SD16PRE1_ 0x00B9
#endif
#ifndef DIVS_DIV1
#define DIVS_DIV1 DIVS_0
#endif
#ifndef DIVS_DIV2
#define DIVS_DIV2 DIVS_1
#endif
#ifndef DIVS_DIV4
#define DIVS_DIV4 DIVS_2
#endif
#ifndef DIVS_DIV8
#define DIVS_DIV8 DIVS_3
#endif
#ifndef USISSEL_USISWCLK
#define USISSEL_USISWCLK USISSEL_4
#endif
#ifndef ERASE
#define ERASE 0x0002
#endif
#ifndef __MSP430_HAS_WDT__
#define __MSP430_HAS_WDT__ 
#endif
#ifndef TA0CTL_
#define TA0CTL_ 0x0160
#endif
#ifndef SD16INCTL0_
#define SD16INCTL0_ 0x00B0
#endif
#ifndef SD16INCTL1_
#define SD16INCTL1_ 0x00B1
#endif
#ifndef USIDIV_DIV1
#define USIDIV_DIV1 USIDIV_0
#endif
#ifndef USIDIV_DIV2
#define USIDIV_DIV2 USIDIV_1
#endif
#ifndef USIDIV_DIV8
#define USIDIV_DIV8 USIDIV_3
#endif
#ifndef USICCTL_
#define USICCTL_ 0x007A
#endif
#ifndef OUTMOD0
#define OUTMOD0 0x0020
#endif
#ifndef OUTMOD1
#define OUTMOD1 0x0040
#endif
#ifndef OUTMOD2
#define OUTMOD2 0x0080
#endif
#ifndef WAIT
#define WAIT 0x0008
#endif
#ifndef USISSEL_TACCR0
#define USISSEL_TACCR0 USISSEL_5
#endif
#ifndef USISSEL_TACCR1
#define USISSEL_TACCR1 USISSEL_6
#endif
#ifndef USISSEL_TACCR2
#define USISSEL_TACCR2 USISSEL_7
#endif
#ifndef FSSEL_ACLK
#define FSSEL_ACLK FSSEL_0
#endif
#ifndef CALDCO_16MHZ_
#define CALDCO_16MHZ_ 0x10F8
#endif
#ifndef BIT0
#define BIT0 0x0001
#endif
#ifndef TAIV_
#define TAIV_ TA0IV_
#endif
#ifndef SD16SSEL_TACLK
#define SD16SSEL_TACLK SD16SSEL_3
#endif
#ifndef DIVA0
#define DIVA0 0x10
#endif
#ifndef DIVA1
#define DIVA1 0x20
#endif
#ifndef __GXX_ABI_VERSION
#define __GXX_ABI_VERSION 102
#endif
#ifndef BIT6
#define BIT6 0x0040
#endif
#ifndef __msp430_headers_timera_h__
#define __msp430_headers_timera_h__ 
#endif
#ifndef WDTHOLD
#define WDTHOLD 0x0080
#endif
#ifndef TASSEL0
#define TASSEL0 0x0100
#endif
#ifndef TASSEL1
#define TASSEL1 0x0200
#endif
#ifndef TASSEL2
#define TASSEL2 0x0400
#endif
#ifndef P1IE_
#define P1IE_ 0x0025
#endif
#ifndef BUSY
#define BUSY 0x0001
#endif
#ifndef TA0IV_
#define TA0IV_ 0x012E
#endif
#ifndef SD16DIV0
#define SD16DIV0 0x0040
#endif
#ifndef SD16DIV1
#define SD16DIV1 0x0080
#endif
#ifndef IFG1_
#define IFG1_ 0x0002
#endif
#ifndef SD16GRP
#define SD16GRP 0x0001
#endif
#ifndef P1IES_
#define P1IES_ 0x0024
#endif
#ifndef __GNUC_MINOR__
#define __GNUC_MINOR__ 2
#endif
#ifndef __MSP430
#define __MSP430 1
#endif
#ifndef SD16BUF1
#define SD16BUF1 0x4000
#endif
#ifndef SD16BUFG
#define SD16BUFG 0x8000
#endif
#ifndef USISRH_
#define USISRH_ 0x007D
#endif
#ifndef CALBC1_8MHZ_
#define CALBC1_8MHZ_ 0x10FD
#endif
#ifndef USICTL1_
#define USICTL1_ 0x0079
#endif
#ifndef TACCTL0_
#define TACCTL0_ TA0CCTL0_
#endif
#ifndef WDTSSEL
#define WDTSSEL 0x0004
#endif
#ifndef __STDC__
#define __STDC__ 1
#endif
#ifndef MC1
#define MC1 0x0020
#endif
#ifndef FCTL1_
#define FCTL1_ 0x0128
#endif
#ifndef WDTIS_0
#define WDTIS_0 0x0000
#endif
#ifndef WDTIS_1
#define WDTIS_1 0x0001
#endif
#ifndef WDTIS_2
#define WDTIS_2 0x0002
#endif
#ifndef WDTIS_3
#define WDTIS_3 0x0003
#endif
#ifndef __PTRDIFF_TYPE__
#define __PTRDIFF_TYPE__ int
#endif
#ifndef USISRL_
#define USISRL_ 0x007C
#endif
#ifndef TACCTL1_
#define TACCTL1_ TA0CCTL1_
#endif
#ifndef FCTL2_
#define FCTL2_ 0x012A
#endif
#ifndef CALBC1_1MHZ_
#define CALBC1_1MHZ_ 0x10FF
#endif
#ifndef P2IES_
#define P2IES_ 0x002C
#endif
#ifndef FCTL3_
#define FCTL3_ 0x012C
#endif
#ifndef MSP430
#define MSP430 1
#endif
#ifndef P1IN_
#define P1IN_ 0x0020
#endif
#ifndef SD16LSBACC
#define SD16LSBACC 0x0040
#endif
#ifndef DIVM0
#define DIVM0 0x10
#endif
#ifndef DIVM1
#define DIVM1 0x20
#endif
#ifndef SD16XDIV_DIV1
#define SD16XDIV_DIV1 SD16XDIV_0
#endif
#ifndef SD16XDIV_DIV2
#define SD16XDIV_DIV2 SD16XDIV_1
#endif
#ifndef SD16XDIV_DIV4
#define SD16XDIV_DIV4 SD16XDIV_2
#endif
#ifndef SD16XDIV_DIV8
#define SD16XDIV_DIV8 SD16XDIV_3
#endif
#ifndef DCOCTL_
#define DCOCTL_ 0x0056
#endif
#ifndef CPUOFF
#define CPUOFF 0x0010
#endif
#ifndef WDTNMIES
#define WDTNMIES 0x0040
#endif
#ifndef __REGISTER_PREFIX__
#define __REGISTER_PREFIX__ 
#endif
#ifndef SD16REFON
#define SD16REFON 0x0004
#endif
#ifndef CM_DISABLE
#define CM_DISABLE CM_0
#endif
#ifndef SD16DIV_DIV1
#define SD16DIV_DIV1 SD16DIV_0
#endif
#ifndef SD16DIV_DIV2
#define SD16DIV_DIV2 SD16DIV_1
#endif
#ifndef SD16DIV_DIV4
#define SD16DIV_DIV4 SD16DIV_2
#endif
#ifndef SD16DIV_DIV8
#define SD16DIV_DIV8 SD16DIV_3
#endif
#ifndef P2OUT_
#define P2OUT_ 0x0029
#endif
#ifndef OSCOFF
#define OSCOFF 0x0020
#endif
#ifndef PORT1_VECTOR
#define PORT1_VECTOR 4
#endif
#ifndef FRKEY
#define FRKEY 0x9600
#endif
#ifndef DIVS0
#define DIVS0 0x02
#endif
#ifndef DIVS1
#define DIVS1 0x04
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1
#endif
#ifndef __NO_INLINE__
#define __NO_INLINE__ 1
#endif
#ifndef USIDIV_DIV128
#define USIDIV_DIV128 USIDIV_7
#endif
#ifndef SD16IV_
#define SD16IV_ __MSP430_SD16IV_BASE__
#endif
#ifndef EPVPPS
#define EPVPPS 0x02
#endif
#ifndef SCCI
#define SCCI 0x0400
#endif
#ifndef P2SEL_
#define P2SEL_ 0x002E
#endif
#ifndef SD16INCH0
#define SD16INCH0 0x0001
#endif
#ifndef SD16INCH1
#define SD16INCH1 0x0002
#endif
#ifndef SD16INCH2
#define SD16INCH2 0x0004
#endif
#ifndef __VERSION__
#define __VERSION__ "3.2.3"
#endif
#ifndef C
#define C 0x0001
#endif
#ifndef N
#define N 0x0004
#endif
#ifndef V
#define V 0x0100
#endif
#ifndef Z
#define Z 0x0002
#endif
#include "CPU/Variants/Variant.h"
#include "CPU/Variants/VariantManager.h"

class Variant_msp430x20x3 : public Variant {
	public:
		Variant_msp430x20x3() {}
		virtual ~Variant_msp430x20x3() {}

		unsigned int getP1DIR() {
#ifdef P1DIR_
			return P1DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP1IE() {
#ifdef P1IE_
			return P1IE_;
#else
			return 0;
#endif
		}


		unsigned int getP1IES() {
#ifdef P1IES_
			return P1IES_;
#else
			return 0;
#endif
		}


		unsigned int getP1IFG() {
#ifdef P1IFG_
			return P1IFG_;
#else
			return 0;
#endif
		}


		unsigned int getP1IN() {
#ifdef P1IN_
			return P1IN_;
#else
			return 0;
#endif
		}


		unsigned int getP1OUT() {
#ifdef P1OUT_
			return P1OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP1REN() {
#ifdef P1REN_
			return P1REN_;
#else
			return 0;
#endif
		}


		unsigned int getP1SEL() {
#ifdef P1SEL_
			return P1SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP2DIR() {
#ifdef P2DIR_
			return P2DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP2IE() {
#ifdef P2IE_
			return P2IE_;
#else
			return 0;
#endif
		}


		unsigned int getP2IES() {
#ifdef P2IES_
			return P2IES_;
#else
			return 0;
#endif
		}


		unsigned int getP2IFG() {
#ifdef P2IFG_
			return P2IFG_;
#else
			return 0;
#endif
		}


		unsigned int getP2IN() {
#ifdef P2IN_
			return P2IN_;
#else
			return 0;
#endif
		}


		unsigned int getP2OUT() {
#ifdef P2OUT_
			return P2OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP2REN() {
#ifdef P2REN_
			return P2REN_;
#else
			return 0;
#endif
		}


		unsigned int getP2SEL() {
#ifdef P2SEL_
			return P2SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP3DIR() {
#ifdef P3DIR_
			return P3DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP3IN() {
#ifdef P3IN_
			return P3IN_;
#else
			return 0;
#endif
		}


		unsigned int getP3OUT() {
#ifdef P3OUT_
			return P3OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP3REN() {
#ifdef P3REN_
			return P3REN_;
#else
			return 0;
#endif
		}


		unsigned int getP3SEL() {
#ifdef P3SEL_
			return P3SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP4DIR() {
#ifdef P4DIR_
			return P4DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP4IN() {
#ifdef P4IN_
			return P4IN_;
#else
			return 0;
#endif
		}


		unsigned int getP4OUT() {
#ifdef P4OUT_
			return P4OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP4REN() {
#ifdef P4REN_
			return P4REN_;
#else
			return 0;
#endif
		}


		unsigned int getP4SEL() {
#ifdef P4SEL_
			return P4SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP5DIR() {
#ifdef P5DIR_
			return P5DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP5IN() {
#ifdef P5IN_
			return P5IN_;
#else
			return 0;
#endif
		}


		unsigned int getP5OUT() {
#ifdef P5OUT_
			return P5OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP5REN() {
#ifdef P5REN_
			return P5REN_;
#else
			return 0;
#endif
		}


		unsigned int getP5SEL() {
#ifdef P5SEL_
			return P5SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP6DIR() {
#ifdef P6DIR_
			return P6DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP6IN() {
#ifdef P6IN_
			return P6IN_;
#else
			return 0;
#endif
		}


		unsigned int getP6OUT() {
#ifdef P6OUT_
			return P6OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP6REN() {
#ifdef P6REN_
			return P6REN_;
#else
			return 0;
#endif
		}


		unsigned int getP6SEL() {
#ifdef P6SEL_
			return P6SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP7DIR() {
#ifdef P7DIR_
			return P7DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP7IN() {
#ifdef P7IN_
			return P7IN_;
#else
			return 0;
#endif
		}


		unsigned int getP7OUT() {
#ifdef P7OUT_
			return P7OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP7REN() {
#ifdef P7REN_
			return P7REN_;
#else
			return 0;
#endif
		}


		unsigned int getP7SEL() {
#ifdef P7SEL_
			return P7SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP8DIR() {
#ifdef P8DIR_
			return P8DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP8IN() {
#ifdef P8IN_
			return P8IN_;
#else
			return 0;
#endif
		}


		unsigned int getP8OUT() {
#ifdef P8OUT_
			return P8OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP8REN() {
#ifdef P8REN_
			return P8REN_;
#else
			return 0;
#endif
		}


		unsigned int getP8SEL() {
#ifdef P8SEL_
			return P8SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP9DIR() {
#ifdef P9DIR_
			return P9DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP9IN() {
#ifdef P9IN_
			return P9IN_;
#else
			return 0;
#endif
		}


		unsigned int getP9OUT() {
#ifdef P9OUT_
			return P9OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP9REN() {
#ifdef P9REN_
			return P9REN_;
#else
			return 0;
#endif
		}


		unsigned int getP9SEL() {
#ifdef P9SEL_
			return P9SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP10DIR() {
#ifdef P10DIR_
			return P10DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP10IN() {
#ifdef P10IN_
			return P10IN_;
#else
			return 0;
#endif
		}


		unsigned int getP10OUT() {
#ifdef P10OUT_
			return P10OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP10REN() {
#ifdef P10REN_
			return P10REN_;
#else
			return 0;
#endif
		}


		unsigned int getP10SEL() {
#ifdef P10SEL_
			return P10SEL_;
#else
			return 0;
#endif
		}


};

MSP430_VARIANT("msp430x20x3", msp430x20x3);

